docs/chapter2.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2020-11-22 Sun 13:41 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Sibi Prabakaran">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://psibi.in/prometheus/"> UP </a>
 |
 <a accesskey="H" href="https://psibi.in/"> HOME </a>
</div><div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Introduction to Prometheus</a></li>
<li><a href="#sec-2">2. Prometheus architecture</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Metrics collection</a></li>
<li><a href="#sec-2-2">2.2. Service discovery</a></li>
<li><a href="#sec-2-3">2.3. Aggregation and alerting</a></li>
<li><a href="#sec-2-4">2.4. Quering data</a></li>
<li><a href="#sec-2-5">2.5. Autonomy</a></li>
<li><a href="#sec-2-6">2.6. Redundancy and high availability</a></li>
<li><a href="#sec-2-7">2.7. Visualization</a></li>
</ul>
</li>
<li><a href="#sec-3">3. The Prometheus data model</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Metric names</a></li>
<li><a href="#sec-3-2">3.2. Labels</a></li>
<li><a href="#sec-3-3">3.3. Samples</a></li>
<li><a href="#sec-3-4">3.4. Notation</a></li>
<li><a href="#sec-3-5">3.5. Metrics retention</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Security model</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction to Prometheus</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Developed internally at SoundCloud.
</li>
<li>Written in Go
</li>
<li>Incubated under CNCF
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Prometheus architecture</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Prometheus works by scraping or pulling time series data exposed
from applications.
</li>
<li>The time series data is exposed by the application themselves often
via client libraries or via proxies called exporters as HTTP
endpoints.
</li>
<li>Prometheus also has a push gateway you can use to receive small
volumes of data - for example, data from targets that can't be
pulled, like transient jobs or targets behind firwall.
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Metrics collection</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Prometheus calls the source of metrics it can scrape endpoints.
</li>
<li>To scrape an endpoint, prometheus defines configuration called a
target.
</li>
<li>Groups of targets are called jobs.
</li>
<li>The resulting time series data is collected and stored locally in
the prometheus server. It can also be sent from the server to
external storage or to another time series database.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Service discovery</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Discovery of resources to be monitored can be handled in a varitey of
ways:
</p>

<ul class="org-ul">
<li>A user provided static list of resources.
</li>
<li>File based discover
</li>
<li>Automated discovery. Eg: consul
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Aggregation and alerting</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>The server can also query and aggregate the time series data and can
create rules to record commonly used queries and aggregations.
</li>
<li>Prometheus can also define rules for alerting.
</li>
<li>Prometheus doesn't come with an inbuilt alerting tool. Instead,
alerts are pushed from the prometheus server to a separate server
called Alertmanager.
</li>
<li>Alertmanager can manager, consolidate and distribute alerts to a
variety of destinations.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Quering data</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Prometheus serves comes with an inbuilt querying language called PromQL.
</li>
<li>The server also comes with an expression browser, a graphing
interface for you to explore the data.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Autonomy</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Each prometheus server is designed to be as autonomous as possible.
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Redundancy and high availability</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Redundancy and high availability center on alerting resilence than
data durability.
</li>
<li>The prometheus team recommends deploying Prometheus server to
specific purposes and teams rather than to a single monolithic
prometheus server.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Visualization</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Visualization is provided via an inbuilt expression brower and
integration with the open source dashboard Grafana.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Prometheus data model</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Prometheus collects time series data. To handle this data it has a
multi dimensional time series data model.
</li>
<li>The time series data model combines time series name and key/value
pairs called labels; these labels provide the dimensions.
</li>
<li>Each time series is uniquely identified by the combination of time
series name and any assigned labels.
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Metric names</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The <b>time series name</b> usually describe the general nature of the time
series data being collected. Ex: <i>website<sub>visits</sub><sub>total</sub></i> as the total
number of website visits.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Labels</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Labels enable the Prometheus dimensional data model. The add context
to specific time series.
</li>
<li>Example: <i>website<sub>visits</sub><sub>total</sub></i> time series could have labels that
identify the name of the website, IP of the requestor etc.
</li>
</ul>

<p>
Labels comes in two broad types:
</p>
<ul class="org-ul">
<li>Instrumentation labels: comes from the resource being
monitored. They are added to the time series before they are scraped
such as by a client or exporter. Eg: HTTP-related time series might
have a label showing specific HTTP verb used.
</li>
<li>Target labels: related more to your architecture. Target labels are
added by Prometheus during and after the scrape. Eg: Label
identifying the data center where the time series originated.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Samples</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The actual value of the time series is called a sample. It consists of
</p>
<ul class="org-ul">
<li>A float64 value.
</li>
<li>A millisecond-precision timestamp.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Notation</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Time series notation
</p>

<pre class="example">
&lt;time seriesa name&gt;{&lt;label name&gt;=&lt;label value&gt;, ...}
</pre>

<p>
Example
</p>

<pre class="example">
total_website_visits{site="MegaApp", location="NJ", instance="webserver", job="web"}
</pre>

<p>
All time series generally have the following label:
</p>
<ul class="org-ul">
<li><b>instance</b> : Identifies the source host or application
</li>
<li><b>job</b>: name of the job that scraped the specific time series.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Metrics retention</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Prometheus is designed for short term monitoring and alerting
needs. By default it keeps 15 days of time series locally in its
database.
</li>
<li>If you want to keep it longer, you can send the required data to
third party applications.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Security model</h2>
<div class="outline-text-2" id="text-4">
<p>
Two braod assumptions are made about trust:
</p>
<ul class="org-ul">
<li>That untrusted users will be able to access the Prometheus server's
HTTP API and hence all the data in the database.
</li>
<li>That only trusted users will have access to the cli, configuration
files, rule files and the runtime configuration of Prometheus and
it's componenets.
</li>
</ul>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Sibi Prabakaran</p>
<p class="date">Created: 2020-11-22 Sun 13:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.4)</p>
</div>
</footer>
</body>
</html>
